read_verilog roclk.v
hierarchy -top roclk
synth_ice40
write_json roclk.json